# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих строках записаны N целых чисел Ai. Последняя строка содержит число X
# 5
# 1 2 3 4 5
# 6
# -> 5

import sys
a = list(map(int, input("Введите количество элементов в массиве: ").split()))
b = int(input("Введите число X: "))
c = []
for i in a:
    c.append(abs(b-i))
d = c.index(min(c))
print(a[d])
